docs/src/LinearAlgebra/expr/expr_selector.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-17 Fri 08:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>expr_selector.hpp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="picaud" />
</head>
<body>
<div id="content">
<h1 class="title">expr_selector.hpp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9286366">1. Motivation</a>
<ul>
<li><a href="#org7d7709c">1.1. The <code>Expr_Selector_Enum</code> enum</a></li>
<li><a href="#orgbe6c2db">1.2. The <code>Expr_Selector</code> class</a></li>
</ul>
</li>
</ul>
</div>
</div>

<p>
<a href="../../../index.html"><b>HOME</b></a> <a href="../index.html"><b>UP</b></a> 
</p>

<div id="outline-container-org9286366" class="outline-2">
<h2 id="org9286366"><span class="section-number-2">1</span> Motivation</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="#orgbe6c2db">The <code>Expr_Selector</code> class</a> allows to induce an <b>order of preference</b> when
selecting the computational subroutines.
</p>

<dl class="org-dl">
<dt>Toy example</dt><dd></dd>
</dl>

<p>
Let's assume that we have:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">enum</span> <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Expr_Selector_Enum</span> : <span style="color: #00688b;">int</span>
  {
   <span style="color: #2e8b57;">Generic</span>,
   <span style="color: #2e8b57;">Blas</span>,
  };

<span style="color: #1c86ee;">template</span> &lt;<span style="color: #00688b;">Expr_Selector_Enum</span> <span style="color: #2e8b57;">EXPR_ORDER</span>&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Expr_Selector</span>;

<span style="color: #1c86ee;">template</span> &lt;&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Expr_Selector</span>&lt;<span style="color: #6e8b3d;">Expr_Selector_Enum</span>::Blas&gt; : <span style="color: #00688b;">Expr_Selector</span>&lt;<span style="color: #6e8b3d;">Expr_Selector_Enum</span>::Generic&gt;
{
};

<span style="color: #1c86ee;">template</span> &lt;&gt;
<span style="color: #1c86ee;">struct</span> <span style="color: #00688b;">Expr_Selector</span>&lt;<span style="color: #6e8b3d;">Expr_Selector_Enum</span>::Generic&gt; 
{
};
</pre>
</div>

<p>
If we write
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">V0_IMPL</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">V1_IMPL</span>&gt;
<span style="color: #00688b;">void</span>
<span style="color: #cd9b1d;">assign</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Expr_Selector</span>&lt;<span style="color: #6e8b3d;">Expr_Selector_Enum</span>::Generic&gt; <span style="color: #2e8b57;">selected</span>,
       <span style="color: #00688b;">Vector_Crtp</span>&lt;X0_TYPE&gt;&amp; <span style="color: #2e8b57;">v0</span>,
       <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;X1_TYPE&gt;&amp; <span style="color: #2e8b57;">v1</span>)
{
  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">call generic implementation</span>
}
<span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">V0_IMPL</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">V1_IMPL</span>&gt;
<span style="color: #1c86ee;">auto</span>
<span style="color: #cd9b1d;">assign</span>(<span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Expr_Selector</span>&lt;<span style="color: #6e8b3d;">Expr_Selector_Enum</span>::Blas&gt; <span style="color: #2e8b57;">selected</span>,
       <span style="color: #00688b;">Vector_Crtp</span>&lt;<span style="color: #00688b;">V0_IMPL</span>&gt;&amp; <span style="color: #2e8b57;">v0</span>,
       <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;<span style="color: #00688b;">V1_IMPL</span>&gt;&amp; <span style="color: #2e8b57;">v1</span>)
  -&gt; <span style="color: #6e8b3d;">std</span>::<span style="color: #00688b;">enable_if_t</span>&lt;<span style="color: #00688b;">Always_True_v</span>&lt;<span style="color: #1c86ee;">decltype</span>(<span style="color: #6e8b3d;">Blas</span>::copy(v0.impl(), v1.impl()))&gt;&gt;

{
  <span style="color: #7f7f7f;">// </span><span style="color: #7f7f7f;">call Blas::copy()</span>
}
</pre>
</div>

<p>
and define the <code>copy()</code> user function as follows:
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">template</span> &lt;<span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">V0_IMPL</span>, <span style="color: #1c86ee;">typename</span> <span style="color: #00688b;">V1_IMPL</span>&gt;
<span style="color: #00688b;">void</span>
<span style="color: #cd9b1d;">assign</span>(<span style="color: #00688b;">Vector_Crtp</span>&lt;X0_TYPE&gt;&amp; <span style="color: #2e8b57;">v0</span>,
       <span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Vector_Crtp</span>&lt;X1_TYPE&gt;&amp; <span style="color: #2e8b57;">v1</span>)
{
  assign(Expr_Selector&lt;<span style="color: #6e8b3d;">Expr_Selector_Enum</span>::Blas&gt;(),v0,v1);
}
</pre>
</div>

<p>
then a call to <code>assign(v0,v1)</code> will first check if a <code>Blas</code> implementation
is available. If not it will branch to the generic implementation.
</p>

<dl class="org-dl">
<dt>Note</dt><dd>to make it work, only the <code>selected</code> argument type must be modified between two specializations:</dd>
</dl>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #1c86ee;">const</span> <span style="color: #00688b;">Expr_Selector</span>&lt;Expr_Selector_Enum::???&gt; <span style="color: #2e8b57;">selected</span>
</pre>
</div>

<p>
This file generalizes this idea.
</p>
</div>

<div id="outline-container-org7d7709c" class="outline-3">
<h3 id="org7d7709c"><span class="section-number-3">1.1</span> The <code>Expr_Selector_Enum</code> enum&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Dev">Dev</span></span></h3>
<div class="outline-text-3" id="text-1-1">
</div>
</div>

<div id="outline-container-orgbe6c2db" class="outline-3">
<h3 id="orgbe6c2db"><a id="ID-77f4e3e6-a212-47ee-8d13-f15d98ffb311"></a><span class="section-number-3">1.2</span> The <code>Expr_Selector</code> class&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Dev">Dev</span></span></h3>
<div class="outline-text-3" id="text-1-2">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: picaud</p>
<p class="date">Created: 2020-07-17 Fri 08:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
